Repository: yamarten/atproto-website
Catalog: translation/omegat/project_save.tmx
Source language: en_us
Languages: ja

source: similar to deletion, Relay processes the event, stops redistributing content, and passes through the event. The Relay should not fully purge content locally, though it may eventually delete local copies if the deactivation status persists for a long time (according to local policy).
ja: 削除と同様にリレーはイベントを処理し、コンテンツ再配布は行わず、イベントをパススルーします。リレーはコンテンツを消去しませんが、長期間無効化されたままであれば削除するかもしれません（ポリシー次第）。

source: similar to deletion, `#commit` events should not be emitted by the PDS, and should be ignored and not passed through if received by Relays
ja: 削除と同様、`#commit`イベントはPDSから送信されず、リレーは受信したとしても無視し、パススルーしません。

source: simple JSON encoding
ja: シンプルなJSONエンコーディング

source: the PDS should not emit `#commit` events for an account which is not "active'. If any further `#commit` messages are emitted for the repo (eg, by accident or out-of-order processing or delivery), all downstream services should ignore the event and not pass it through
ja: PDSは`active`ではないアカウントの`#commit`を送信しません。もしそのリポジトリについて（アクシデントや処理または配送の順番乱れによって）何かしら`#commit`が送信されても、下流のサービスはそのイベントを無視し、パススルーもしません。

source: the PDS will generate or confirm the existence of the account's identity (DID and handle). Once the DID is in a confirmed state that can be resolved by other services in the network, and points to the current PDS instance, the PDS emits an `#identity` event. It is good, but not required, to wait until the handle is resolvable by third parties before emitting the event (especially, but not only, if the PDS is providing a handle for the account). The account status may or may not be `active` when this event is emitted.
ja: PDSはアカウントのID（DIDやハンドル）を生成したり、存在を確認します。DIDがネットワーク上の他サービスから解決可能かつ現在のPDSを指すことが確認されたら、PDSは`#identity`イベントを送信します。送信前にハンドルもサードパーティから解決可能になることが望ましいですが、必須ではありません（特にそのPDSがアカウントにハンドルを提供する場合はそうですが、その場合に限りません）。イベント送信時、アカウント状態は`active`かもしれませんし、そうでないかもしれません。

source: the `app.bsky.richtext.facet` system can be used to annotate short text strings in a way that is simpler and safer to work with than full-featured markup languages
ja: `app.bsky.richtext.facet`システムは、フル機能のマークアップ言語よりも単純で安全な方法で短い文字列を装飾するために使用できます

source: the `limit` value is an upper limit, and the response may include fewer (or even zero) results, while further results are still available. It is the lack of `cursor` in responses that indicates pagination is complete. The response set may have items removed if they are tombstoned or have been otherwise filtered from the response set.
ja: `limit`値は上限であり、より多くの結果が利用可能だとしても、レスポンスには少ない（またはゼロの）結果が含まれる可能性があります。ページネーションの完了を示すのは、レスポンスに`cursor`がないことです。レスポンスからは、削除が示されている場合や他の方法でフィルタリングされた場合、項目が取り除かれることがあります。

source: the endpoint has an optional `cursor` query parameter (integer)
ja: エンドポイントにはオプションの`cursor`クエリパラメータ（整数）があります

source: the feature type system is an open union which can be extended with additional types
ja: この機能の型システムは、追加の型で拡張できるオープンな共用体です

source: the initial client request does not define a `cursor`. If the response includes a `cursor`, then more results are available, and the client should query again with the new `cursor` to get more results
ja: クライアントによる最初のリクエストでは`cursor`を定義しません。レスポンスに`cursor`が含まれている場合はより多くの結果が利用可能であり、クライアントは新しい`cursor`でクエリを再度実行して追加の結果を取得します

source: the new PDS will not emit any events on initial account creation. The account state will be `deactivated` on the new PDS (which will reply as such to API requests)
ja: 新しいPDSはアカウント作成時にはイベントを送信しません。新しいPDSにおけるアカウント状態は`deactivated`です（APIに対してそのように応答します）。

source: the output body includes optional `cursor` (string) and a required array of response objects (with context-specific pluralized field name)
ja: 出力のボディには、オプションの`cursor`（文字列）と、必須のレスポンスオブジェクト配列（コンテキスト固有の複数形フィールド名を持つ）が含まれます

source: the path does not need to include `oauth-client-metadata.json`, but it is helpful convention.
ja: パスに`oauth-client-metadata.json`を含める必要はありませんが、慣例としては役立ちます。

source: the schema must be `https://`, and there must not be a port number included. Note that there is a [special exception](/specs/oauth#localhost-client-development) for `http://localhost` `client_id` values for development.
ja: スキーマは`https://`でなければならず、ポート番号を含めてはいけません。開発用には`http://localhost`の`client_id`に対する[特別な例外](/specs/oauth#localhost-client-development)がある点に注意してください。

source: the specific order of events is not formally specified, but the recommended order is: `#identity`, `#account`, `#commit`
ja: イベントの順序は正式には決まっていませんが、`#identity`、`#account`、`#commit`の順を推奨します。

source: try { // Optimistically update our SQLite <-- HERE! await db .insertInto('status') .values({ uri, authorDid: agent.assertDid, status: record.status, createdAt: record.createdAt, indexedAt: new Date().toISOString(), }) .execute() } catch (err) { logger.warn( { err }, 'failed to update computed view; ignoring as it should be caught by the firehose' ) }
ja: try { // SQLite を楽観的に更新します <-- ここ! await db .insertInto('status') .values({ uri, authorDid: agent.assertDid, status: record.status, createdAt: record.createdAt, indexedAt: new Date().toISOString(), }) .execute() } catch (err) { logger.warn( { err }, 'failed to update computed view; ignoring as it should be caught by the firehose' ) }

source: try { // Write the status record to the user's repository await agent.com.atproto.repo.putRecord({ repo: agent.assertDid, collection: 'xyz.statusphere.status', rkey: TID.nextStr(), record, }) } catch (err) { logger.warn({ err }, 'failed to write record') return res.status(500).type('html').send('Error: Failed to write record') }
ja: try { // ステータス レコードをユーザーのリポジトリに書き込みます await agent.com.atproto.repo.putRecord({ repo: agent.assertDid, collection: 'xyz.statusphere.status', rkey: TID.nextStr(), record, }) } catch (err) { logger.warn({ err }, 'failed to write record') return res.status(500).type('html').send('Error: Failed to write record') }

source: use a `.defs` schema for definitions which might be reused by multiple schemas in the same namespace, or by third parties
ja: 同じ名前空間内の複数のスキーマまたはサードパーティによって再利用される可能性がある定義には、`.defs`スキーマを使用してください

source: use object types containing a single element/field instead of atomic data types in arrays, to allow additional context to be included in the future
ja: 配列でアトミックデータ型の代わりに、単一の要素/フィールドを含むオブジェクト型を使用して、将来追加のコンテキストを含めることを許可してください

source: users followed by <0>@{0}</0>
ja: <0>@{0}</0>にフォローされているユーザー

source: users following <0>@{0}</0>
ja: <0>@{0}</0>をフォローしているユーザー

source: when the account is deactivated on the old PDS, it should emit an `#account` event, indicating that the account is inactive and has status `deactivated`.
ja: アカウントが古いPDSで無効化されると、PDSは`#account`イベントを送信してアカウントが無効化したことを示し、`deactivated`状態にします。

source: when the account is switched to `active` on the new PDS, it should emit an `#account` event and a `#commit` event; the order is not formally required, but doing `#account` first is recommended. Ideally the `#commit` event will be empty (no new records), but signed with any new signing key, and have a new/incremented `rev`.
ja: 新しいPDSでアカウントが`active`に変更されたら、PDSは`#account`および`#commit`イベントを送信します。順序は正式には決まっていませんが、`#account`を先にすることを推奨します。理想的には`#commit`イベントは空（新規レコード無し）ですが、新しい署名鍵で署名されており、新しい、または増加した`rev`を持ちます。

source: when the account's repository is initialized with a `rev` and `commit`, a `#commit` message can be emitted. The initial repo may be "empty" (no records), or may contain records.
ja: アカウントのリポジトリは`rev`と`commit`が初期化され、`#commit`イベントが送信されます。初期リポジトリは空（レコード無し）かもしれませんし、レコードを含んでいるかもしれません。

source: when the identity is updated and confirmed by the new PDS, it should emit an `#identity` event
ja: 新しいPDSによってIDが更新および確認されると、PDSは`#identity`イベントを送信します。

source: www.mylivestream.tv
ja: live.example.jp

source: you can add new `optional` fields to a schema without changing backwards compatibility or requiring a V2 schema, but you can’t add new `required` fields
ja: 後方互換性を変更したり、V2スキーマを使ったりせずに、スキーマに新しい`optional`フィールドを追加できますが、新しい`required`フィールドを追加することはできません

source: {/* <ImageCard image={HowDoesBlueskyWorkBlogpostPng} href="https://steveklabnik.com/writing/how-does-bluesky-work/" title="How does Bluesky work?" tag="Community Blogpost" description="A blog post by Steve Klabnik describing how Bluesky and ATProto work at a high level." /> */}
ja: {/* <ImageCard image={HowDoesBlueskyWorkBlogpostPng} href="https://steveklabnik.com/writing/how-does-bluesky-work/" title="Blueskyはどのように機能しますか？" tag="Community Blogpost" description="BlueskyとATプロトコルが高レベルでどのように機能するかを説明するSteve Klabnikのブログ投稿。" /> */}

source: {/* <ImageCard image={TbdIntervewJpg} href="https://www.youtube.com/live/D5WVK7KfTAk" title="Building the Social Internet with Bluesky's AT Protocol" tag="Interview" description="An interview between Dan Abramov and TBD about how the dotmedia Protocol works.png" /> */}
ja: {/* <ImageCard image={TbdInterviewJpg} href="https://www.youtube.com/live/D5WVK7KfTAk" title="BlueskyのATプロトコルでソーシャルインターネットを構築する" tag="Interview" description="ATプロトコルの仕組みに関するDan Abramov氏とTB氏によるインタビュー。このトピックを初めて知る人にとっては素晴らしい入門書です。" /> */}

source: {0, plural, one {# day} other {# days}}
ja: {0, plural, other {#日}}

source: {0, plural, one {# follower} other {# followers}}
ja: {0, plural, other {# フォロワー}}

source: {0, plural, one {# following} other {# following}}
ja: {0, plural, other {# フォロー中}}

source: {0, plural, one {# friend found!} other {# friends found!}}
ja: {0, plural, one {友達が#人見つかりました！} other {友達が#人見つかりました！}}

source: {0, plural, one {# hour} other {# hours}}
ja: {0, plural, other {#時間}}

source: {0, plural, one {# label has} other {# labels have}} been placed on this account
ja: {0, plural, other {#件のラベル}}がこのアカウントに適用されています

source: {0, plural, one {# label has} other {# labels have}} been placed on this content
ja: {0, plural, other {#件のラベル}}がこのコンテンツに適用されています

source: {0, plural, one {# like} other {# likes}}
ja: {0, plural, other {# いいね}}

source: {0, plural, one {# minute} other {# minutes}}
ja: {0, plural, other {#分}}

source: {0, plural, one {# month} other {# months}}
ja: {0, plural, other {#ヶ月}}

source: {0, plural, one {# quote} other {# quotes}}
ja: {0, plural, other {# 引用}}

source: {0, plural, one {# repost} other {# reposts}}
ja: {0, plural, other {# リポスト}}

source: {0, plural, one {# second} other {# seconds}}
ja: {0, plural, other {#秒}}

source: {0, plural, one {# unread item} other {# unread items}}
ja: {0, plural, other {#件の未読}}

source: {0, plural, one {#mo} other {#mo}}
ja: {0, plural, other {#ヶ月}}

source: {0, plural, one {follower} other {followers}}
ja: {0, plural, other {フォロワー}}

source: {0, plural, one {following} other {following}}
ja: {0, plural, other {フォロー中}}

source: {0, plural, one {like} other {likes}}
ja: {0, plural, other {いいね}}

source: {0, plural, one {post} other {posts}}
ja: {0, plural, other {投稿}}

source: {0, plural, one {quote} other {quotes}}
ja: {0, plural, other {引用}}

source: {0, plural, one {repost} other {reposts}}
ja: {0, plural, other {リポスト}}

source: {0, plural, one {save} other {saves}}
ja: {0, plural, other {保存}}

source: {0, plural, other {# people have}} used this starter pack!
ja: {0, plural, other {#人が}}このスターターパックを使用しました！

source: {0, plural, other {+# more}}
ja: {0, plural, other {+#}}

source: {0, plural, other {{1} posts}}
ja: {0, plural, other {{1}件の投稿}}

source: {0} (Account)
ja: {0}（アカウント）

source: {0} <0>in <1>tags</1></0>
ja: <0><1>タグ</1>中の</0>{0}

source: {0} <0>in <1>text & tags</1></0>
ja: <0><1>テキストとタグ</1>中の</0>{0}

source: {0} following
ja: {0} フォロー中

source: {0} is live
ja: {0}はライブ中

source: {0} is not a valid URL
ja: {0} は有効な URL ではありません

source: {0} is not available
ja: {0}は利用できません

source: {0} joined this week
ja: 今週、{0}人が参加しました

source: {0} reacted {1}
ja: {0}が{1}とリアクションしました

source: {0} reacted {1} to {2}
ja: {0}が{2}に{1}とリアクションしました

source: {0}'s avatar
ja: {0}のアバター

source: {0}'s favorite feeds and people - join me!
ja: {0}のお気に入りのフィードとユーザーです - 参加してね！

source: {0}'s starter pack
ja: {0}のスターターパック

source: {0}, a feed by {1}, liked by {2}
ja: {0}、{1}によるフィード、{2}人がいいね

source: {0}, a list by {1}
ja: {0}、{1}によるリスト

source: {0}d
ja: {0}日

source: {0}h
ja: {0}時間

source: {0}m
ja: {0}分

source: {0}s
ja: {0}秒

source: {DESCRIPTION_MAX_GRAPHEMES, plural, other {Description is too long. The maximum number of characters is #.}}
ja: {DESCRIPTION_MAX_GRAPHEMES, plural, other {説明が長すぎます。最大#文字までです。}}

source: {DISPLAY_NAME_MAX_GRAPHEMES, plural, other {Display name is too long. The maximum number of characters is #.}}
ja: {DISPLAY_NAME_MAX_GRAPHEMES, plural, other {表示名が長すぎます。最大#文字までです。}}

source: {count, plural, one {# unread item} other {# unread items}}
ja: {count, plural, other {#件の未読}}

source: {displayName}'s Starter Pack
ja: {displayName}のスターターパック

source: {estimatedTimeHrs, plural, one {hour} other {hours}}
ja: {estimatedTimeHrs, plural, other {時間}}

source: {estimatedTimeMins, plural, one {minute} other {minutes}}
ja: {estimatedTimeMins, plural, other {分}}

source: {firstAuthorLink} and <0>{additionalAuthorsCount, plural, one {{formattedAuthorsCount} other} other {{formattedAuthorsCount} others}}</0> followed you
ja: {firstAuthorLink}および<0>{additionalAuthorsCount, plural, other {他{formattedAuthorsCount}人}}</0>があなたをフォローしました

source: {firstAuthorLink} and <0>{additionalAuthorsCount, plural, one {{formattedAuthorsCount} other} other {{formattedAuthorsCount} others}}</0> liked your custom feed
ja: {firstAuthorLink}および<0>{additionalAuthorsCount, plural, other {他{formattedAuthorsCount}人}}</0>があなたのカスタムフィードをいいねしました

source: {firstAuthorLink} and <0>{additionalAuthorsCount, plural, one {{formattedAuthorsCount} other} other {{formattedAuthorsCount} others}}</0> liked your post
ja: {firstAuthorLink}および<0>{additionalAuthorsCount, plural, other {他{formattedAuthorsCount}人}}</0>があなたの投稿をいいねしました

source: {firstAuthorLink} and <0>{additionalAuthorsCount, plural, one {{formattedAuthorsCount} other} other {{formattedAuthorsCount} others}}</0> liked your repost
ja: {firstAuthorLink}および<0>{additionalAuthorsCount, plural, other {他{formattedAuthorsCount}人}}</0>があなたのリポストをいいねしました

source: {firstAuthorLink} and <0>{additionalAuthorsCount, plural, one {{formattedAuthorsCount} other} other {{formattedAuthorsCount} others}}</0> removed their verifications from your account
ja: {firstAuthorLink} と <0>{additionalAuthorsCount, plural, other {他{formattedAuthorsCount}人}}</0> があなたのアカウントから認証を削除しました

source: {firstAuthorLink} and <0>{additionalAuthorsCount, plural, one {{formattedAuthorsCount} other} other {{formattedAuthorsCount} others}}</0> reposted your post
ja: {firstAuthorLink}および<0>{additionalAuthorsCount, plural, other {他{formattedAuthorsCount}人}}</0>があなたの投稿をリポストしました

source: {firstAuthorLink} and <0>{additionalAuthorsCount, plural, one {{formattedAuthorsCount} other} other {{formattedAuthorsCount} others}}</0> reposted your repost
ja: {firstAuthorLink}および<0>{additionalAuthorsCount, plural, other {他{formattedAuthorsCount}人}}</0>があなたのリポストをリポストしました

source: {firstAuthorLink} and <0>{additionalAuthorsCount, plural, one {{formattedAuthorsCount} other} other {{formattedAuthorsCount} others}}</0> signed up with your starter pack
ja: {firstAuthorLink}および<0>{additionalAuthorsCount, plural, other {他{formattedAuthorsCount}人}}</0>があなたのスターターパックでサインアップしました

source: {firstAuthorLink} and <0>{additionalAuthorsCount, plural, one {{formattedAuthorsCount} other} other {{formattedAuthorsCount} others}}</0> verified you
ja: {firstAuthorLink} と <0>{additionalAuthorsCount, plural, other {他{formattedAuthorsCount}人}}</0> があなたを認証しました

source: {firstAuthorLink} followed you
ja: {firstAuthorLink}があなたをフォローしました

source: {firstAuthorLink} followed you back
ja: {firstAuthorLink}があなたをフォローバックしました

source: {firstAuthorLink} liked your custom feed
ja: {firstAuthorLink}があなたのカスタムフィードをいいねしました

source: {firstAuthorLink} liked your post
ja: {firstAuthorLink}があなたの投稿をいいねしました

source: {firstAuthorLink} liked your repost
ja: {firstAuthorLink}があなたのリポストをいいねしました

source: {firstAuthorLink} removed their verification from your account
ja: {firstAuthorLink} があなたのアカウントから認証を削除しました

source: {firstAuthorLink} reposted your post
ja: {firstAuthorLink}があなたの投稿をリポストしました

source: {firstAuthorLink} reposted your repost
ja: {firstAuthorLink}があなたのリポストをリポストしました

source: {firstAuthorLink} signed up with your starter pack
ja: {firstAuthorLink}があなたのスターターパックでサインアップしました

source: {firstAuthorLink} verified you
ja: {firstAuthorLink} があなたを認証しました

source: {firstAuthorName} and {additionalAuthorsCount, plural, one {{formattedAuthorsCount} other} other {{formattedAuthorsCount} others}} followed you
ja: {firstAuthorName}および{additionalAuthorsCount, plural, other {他{formattedAuthorsCount}人}}があなたをフォローしました

source: {firstAuthorName} and {additionalAuthorsCount, plural, one {{formattedAuthorsCount} other} other {{formattedAuthorsCount} others}} liked your custom feed
ja: {firstAuthorName}および{additionalAuthorsCount, plural, other {他{formattedAuthorsCount}人}}があなたのカスタムフィードをいいねしました

source: {firstAuthorName} and {additionalAuthorsCount, plural, one {{formattedAuthorsCount} other} other {{formattedAuthorsCount} others}} liked your post
ja: {firstAuthorName}および{additionalAuthorsCount, plural, other {他{formattedAuthorsCount}人}}があなたの投稿をいいねしました

source: {firstAuthorName} and {additionalAuthorsCount, plural, one {{formattedAuthorsCount} other} other {{formattedAuthorsCount} others}} liked your repost
ja: {firstAuthorName}および{additionalAuthorsCount, plural, other {他{formattedAuthorsCount}人}}があなたのリポストをいいねしました

source: {firstAuthorName} and {additionalAuthorsCount, plural, one {{formattedAuthorsCount} other} other {{formattedAuthorsCount} others}} removed their verifications from your account
ja: {firstAuthorName} と {additionalAuthorsCount, plural, other {他{formattedAuthorsCount}人}} があなたのアカウントから認証を削除しました

source: {firstAuthorName} and {additionalAuthorsCount, plural, one {{formattedAuthorsCount} other} other {{formattedAuthorsCount} others}} reposted your post
ja: {firstAuthorName}および{additionalAuthorsCount, plural, other {他{formattedAuthorsCount}人}}があなたの投稿をリポストしました

source: {firstAuthorName} and {additionalAuthorsCount, plural, one {{formattedAuthorsCount} other} other {{formattedAuthorsCount} others}} reposted your repost
ja: {firstAuthorName}および{additionalAuthorsCount, plural, other {他{formattedAuthorsCount}人が}}あなたのリポストをリポストしました

source: {firstAuthorName} and {additionalAuthorsCount, plural, one {{formattedAuthorsCount} other} other {{formattedAuthorsCount} others}} signed up with your starter pack
ja: {firstAuthorName}および{additionalAuthorsCount, plural, other {他{formattedAuthorsCount}人}}があなたのスターターパックでサインアップしました

source: {firstAuthorName} and {additionalAuthorsCount, plural, one {{formattedAuthorsCount} other} other {{formattedAuthorsCount} others}} verified you
ja: {firstAuthorName} と {additionalAuthorsCount, plural, other {他{formattedAuthorsCount}人}} があなたを認証しました

source: {firstAuthorName} followed you
ja: {firstAuthorName}があなたをフォローしました

source: {firstAuthorName} followed you back
ja: {firstAuthorName}があなたをフォローバックしました

source: {firstAuthorName} liked your custom feed
ja: {firstAuthorName}があなたのカスタムフィードをいいねしました

source: {firstAuthorName} liked your post
ja: {firstAuthorName}があなたの投稿をいいねしました

source: {firstAuthorName} liked your repost
ja: {firstAuthorName}があなたのリポストをいいねしました

source: {firstAuthorName} removed their verification from your account
ja: {firstAuthorName} があなたのアカウントから認証を削除しました

source: {firstAuthorName} reposted your post
ja: {firstAuthorName}があなたの投稿をリポストしました

source: {firstAuthorName} reposted your repost
ja: {firstAuthorName}があなたのリポストをリポストしました

source: {firstAuthorName} signed up with your starter pack
ja: {firstAuthorName}があなたのスターターパックでサインアップしました

source: {firstAuthorName} verified you
ja: {firstAuthorName} があなたを認証しました

source: {following} following
ja: {following} フォロー

source: {handle} can't be messaged
ja: {handle}にメッセージを送れません

source: {hours, plural, one {# hour {minutesString}} other {# hours {minutesString}}}
ja: {hours, plural, other {#時間{minutesString}}}

source: {hours, plural, one {# hour} other {# hours}}
ja: {hours, plural, other {#時間}}

source: {joinedAllTimeCount, plural, other {# users have}} joined!
ja: {joinedAllTimeCount, plural, other {#人のユーザーが}}参加しました！

source: {minutes, plural, one {# minute} other {# minutes}}
ja: {minutes, plural, other {#分}}

source: {notificationCount, plural, one {# unread item} other {# unread items}}
ja: {notificationCount, plural, other {#件の未読}}

source: {numMatches, plural, one {1 contact found} other {# contacts found}}
ja: {numMatches, plural, one {連絡先が1つ見つかりました} other {連絡先が#個見つかりました}}

source: {profileName} joined Bluesky using a starter pack {timeAgoString} ago
ja: {profileName}はスターターパックを使って{timeAgoString}前に参加しました

source: {profileName} joined Bluesky {timeAgoString} ago
ja: {profileName}はBlueskyに{timeAgoString}前に参加しました

source: {type}h ago
ja: {type}時間前

source: {userName} is a trusted verifier
ja: {userName} は信頼された認証者です

source: {userName} is verified
ja: {userName} は認証されています

source: {userName}'s verifications
ja: {userName}の認証情報

source: | **Blurs** | **Severity** | **Description** | | --- | --- | --- | | `content` | `alert` | Hide the content and put a "danger" warning label on the content if viewed | | `content` | `inform` | Hide the content and put a "neutral" information label on the content if viewed | | `content` | `none` | Hide the content | | `media` | `alert` | Hide images in the content and put a "danger" warning label on the content if viewed | | `media` | `inform` | Hide images in the content and put a "neutral" information label on the content if viewed | | `media` | `none` | Hide images in the content | | `none` | `alert` | Put a "danger" warning label on the content | | `none` | `inform` | Put a "neutral" information label on the content | | `none` | `none` | No visual effect |
ja: | **blurs** | **severity** | **説明** | | --- | --- | --- | | `content` | `alert` | コンテンツを非表示にして、表示時に「危険」警告ラベルをコンテンツに置きます | | `content` | `inform` | コンテンツを非表示にして、表示時に「中立」情報ラベルをコンテンツに置きます | | `content` | `none` | コンテンツを非表示にします | | `media` | `alert` | コンテンツ内の画像を非表示にして、表示時に「危険」警告ラベルをコンテンツに置きます | | `media` | `inform` | コンテンツ内の画像を非表示にして、表示時に「中立」情報ラベルをコンテンツに置きます | | `media` | `none` | コンテンツ内の画像を非表示にします | | `none` | `alert` | 「危険」警告ラベルをコンテンツに置きます | | `none` | `inform` | 「中立」情報ラベルをコンテンツに置きます | | `none` | `none` | 視覚的効果なし |
